int main()
{
	int arr1[5][4] = { {11,21,-3,-4},
		{5,-6,0,8},
		{9,11,2,0},
		{4,-4,1,3},
		{0,1,-9,6} };

	int arr2[4] = { 0 };

	for (int i = 0; i < 4; i++)
	{
		for (int j = 0; j < 5; j++)
		{
			arr2[i] += arr1[j][i];
		}
	}

	float arr3[4][5] = { {1.1,-2.0,5.5,1.2,-8.3},
		{-0.2,-6.5,3.0,4.5,6.0},
		{-2.9,-3.1,4.4,7.2,-8.1},
		{-2.6,-1.2,3.4,5.4,6.6} };

	float max_arrs[4];

	for (int i = 0; i < 4; ++i) 
	{
		max_arrs[i] = arr3[i][0];//Ініціалізуємо максимальне значення першим елементом рядка

		
		for (int j = 1; j < 5; ++j)
		{
			if (arr3[i][j] > max_arrs[i])
			{
				max_arrs[i] = arr3[i][j];//Оновлюємо максимальне значення, якщо знайшли більше
			}
		}
	}
}
